vanvught/GD32H759I-EVAL-board-DMX512-RDM/gd32_emac_pwm_example/firmware/main.cpp
/**
 * @file main.cpp
 *
 */
/* Copyright (C) 2024-2026 by Arjan van Vught mailto:info@gd32-dmx.org
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:

 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include <time.h>

#include "board.h"
#include "watchdog.h"
#include "network.h"
#include "displayudf.h"
#include "json/displayudfparams.h"
#include "remoteconfig.h"
#include "configstore.h"
#include "firmware/firmwareversion.h"
#include "software_version.h"
#include "gd32_pwm.h"

namespace board {
void RebootHandler() {}
} // namespace board

int main() {
    board::Init();
    DisplayUdf display;
    ConfigStore config_store;
    network::Init();
    FirmwareVersion fw(kSoftwareVersion, __DATE__, __TIME__);

    fw.Print("Debug PWM");

    display.SetTitle("Debug");
    display.Set(2, displayudf::Labels::kHostname);
    display.Set(3, displayudf::Labels::kIp);
    display.Set(4, displayudf::Labels::kVersion);
    display.Set(5, displayudf::Labels::kBoardname);
    display.Set(6, displayudf::Labels::kNetmask);

    json::DisplayUdfParams displayudf_params;
    displayudf_params.Load();
    displayudf_params.SetAndShow();

    RemoteConfig remote_config(remoteconfig::Output::CONFIG, 0);

    watchdog::Init();

    auto t1 = time(nullptr);

    gd32_pwm_begin();
    gd32_pwm_set_duty_cycle(pwm::Channel::PWM_CHANNEL_1, 25U);
    gd32_pwm_set_duty_cycle(pwm::Channel::PWM_CHANNEL_2, 50U);
    gd32_pwm_set_duty_cycle(pwm::Channel::PWM_CHANNEL_3, 75U);

    for (;;) {
        watchdog::Feed();
        network::Run();
        board::Run();

        const auto kT2 = time(nullptr);

        if (t1 != kT2) {
            t1 = kT2;
            gd32_pwm_set_duty_cycle(pwm::Channel::PWM_CHANNEL_0, (t1 & 0x7) * 10);
        }
    }
}
